    var cities=new Array(13);//创建一个二维数组存放地市,区县
    cities[0]=new Array("岳麓区（望岳街道）","开福区（芙蓉北路街道）","芙蓉区（东屯渡街道）","望城区（高塘岭街道）","天心区（青园街道）","雨花区（圭塘街道）","长沙县（星沙街道）","浏阳市（关口街道）","宁乡市（玉潭街道）");
    cities[1]=new Array("天元区（嵩山路街道）","石峰区（响石岭街道）","荷塘区（桂花街道）","芦淞区（枫溪街道）","渌口区（渌口镇）","醴陵市（仙岳山街道）","茶陵县（云阳街道）","炎陵县（霞阳镇）","攸县（联星街道）");
    cities[2]=new Array("岳塘区（五里堆街道）","雨湖区（雨湖路街道）","湘乡市（望春门街道）","韶山市（清溪镇）","湘潭县（易俗河镇）");
    cities[3]=new Array("雁峰区（雁峰街道）","蒸湘区（蒸湘街道）","南岳区（祝融街道）","珠晖区（广东路街道）","石鼓区（黄沙湾街道）","耒阳市（蔡子池街道）","常宁市（宜阳街道）","祁东县（玉合街道）","衡阳县（西渡镇）","衡东县（洣水镇）","衡山县（开云镇）","衡南县（云集镇）");
    cities[4]=new Array("双清区（汽车站街道）","北塔区（状元洲街道）","大祥区（城南街道）","武冈市（迎春亭街道","邵东市（大禾塘街道）","洞口县（文昌街道）","邵阳县（塘渡口镇）","新邵县（酿溪镇）","绥宁县（长铺镇）","新宁县（金石镇）","隆回县（桃洪镇）","城步苗族自治县（儒林镇");
    cities[5]=new Array("岳阳楼区（五里牌街道","君山区（柳林洲街道）","云溪区（云溪镇）","临湘市（长安街道）","汨罗市（归义镇）","岳阳县（荣家湾镇）","湘阴县（文星镇）","平江县（汉昌镇）","华容县（章华镇）");
    cities[6]=new Array("武陵区（南坪岗乡）","鼎城区（红云街道）","津市市（襄阳街街道","汉寿县（龙阳街道）","石门县（楚江街道）","临澧县（安福镇）","桃源县（漳江镇）","安乡县（深柳镇）","澧县（澧阳街道）");
    cities[7]=new Array("永定区（西溪坪街道）","武陵源区（军地坪街道","慈利县（零阳镇）","桑植县（澧源镇）");
    cities[8]=new Array("赫山区（赫山街道）","资阳区（大码头街道）","沅江市（琼湖街道）","桃江县（桃花江镇）","安化县（东坪镇）","南县（南洲镇）");
    cities[9]=new Array("北湖区（骆仙街道）","苏仙区（苏仙岭街道）","资兴市（唐洞街道）","安仁县（永乐江镇）","桂阳县（龙潭街道","宜章县（玉溪镇）","汝城县（卢阳镇）","嘉禾县（珠泉镇）","临武县（舜峰镇）","桂东县（沤江镇）","永兴县（便江镇");
    cities[10]=new Array("冷水滩区（梧桐街道）","零陵区（徐家井街道）","道县（濂溪街道）","蓝山县（塔峰镇）","新田县（龙泉镇）","江永县（潇浦镇）","双牌县（泷泊镇）","祁阳县（长虹街道）","宁远县（舜陵街道）","东安县（白牙市镇）","江华瑶族自治县（沱江镇）");
    cities[11]=new Array("鹤城区（红星街道)","洪江市（黔城镇）","会同县（林城镇）","沅陵县（沅陵镇）","辰溪县（辰阳镇）","溆浦县（卢峰镇））","中方县（中方镇）","新晃侗族自治县（晃州镇）","芷江侗族自治县（芷江镇）","通道侗族自治县（双江镇）","麻阳苗族自治县（高村镇）","靖州苗族侗族自治县（渠阳镇）");
    cities[12]=new Array("娄星区（长青街道）","冷水江市（冷水江街道）","涟源市（蓝田街道）","新化县（上梅镇）","双峰县（永丰镇）");
    cities[13]=new Array("吉首市（乾州街道）","龙山县（民安街道）","古丈县（古阳镇）","永顺县（灵溪镇）","凤凰县（沱江镇）","凤凰县（沱江镇）","保靖县（迁陵镇）","花垣县（花垣镇）");

//设置点击事件
    function changeCity(val){
        //alert(val);
        var cityEle=document.getElementById("city");//获取第二个下拉列表对象
        cityEle.options.length=0;//清空第二个下拉列表的option内容
        //1.先遍历省份
        for(var i=0;i<cities.length;i++){
            //2.创建城市的文本节点
            if(val==i) {
               ////3.遍历用户选择的省份下的城市
                for (var j=0;j<cities[i].length;j++){
                    //alert(cities[i][j]);
                    //创建文本节点
                     var textNode=document.createTextNode(cities[i][j]);
                     //创建option元素节点
                    var opEle=document.createElement("option");
                    //添加元素到子节点
                    opEle.appendChild(textNode);
                    //将创建的option元素节点添加到第二个下拉列表中去
                     cityEle.appendChild(opEle);
                }
            }
        }
    }